load-tests/config/base-config.yml
# Designed and Implemented by Amin Ghaderi
#
# Canonical HTTP target and load phases for FlashBid Artillery scenarios.
# Artillery does not merge multiple YAML files; copy this block under `config:`
# in each scenario (or keep this file as the single source of truth when editing).
#
# Target: FlashBid.Api HTTP listener (see launchSettings / README).

config:
  target: "http://localhost:5091"
  processor: "../scripts/helpers.js"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "warm-up"
    - duration: 60
      arrivalRate: 5
      name: "ramp-up"
    - duration: 120
      arrivalRate: 20
      name: "peak"